examples/single_turbine_uniform_inflow/kefp/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../setup"

simulationType RAS;

RAS
{
    RASModel            kEpsilonFp;

    turbulence          on;

    printCoeffs         on;

    kEpsilonFpCoeffs
    {
        Cmu         $Cmu; 
        C1          $Ceps1;
        C2          $Ceps2;
        sigmaEps    $sige; 
        Cr          $Cr; 
    }
}

// ************************************************************************* //
